espressif/arduino-esp32/boards.txt
##############################################################

t-beam.name=T-Beam

t-beam.upload.tool=esptool
t-beam.upload.maximum_size=1310720
t-beam.upload.maximum_data_size=327680
t-beam.upload.wait_for_upload_port=true

t-beam.serial.disableDTR=true
t-beam.serial.disableRTS=true

t-beam.build.mcu=esp32
t-beam.build.core=esp32
t-beam.build.variant=t-beam
t-beam.build.board=T-Beam

t-beam.build.f_cpu=240000000L
t-beam.build.flash_mode=dio
t-beam.build.flash_size=4MB
t-beam.build.boot=dio
t-beam.build.partitions=default

t-beam.menu.PSRAM.disabled=Disabled
t-beam.menu.PSRAM.disabled.build.defines=
t-beam.menu.PSRAM.enabled=Enabled
t-beam.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

t-beam.menu.FlashFreq.80=80MHz
t-beam.menu.FlashFreq.80.build.flash_freq=80m
t-beam.menu.FlashFreq.40=40MHz
t-beam.menu.FlashFreq.40.build.flash_freq=40m

t-beam.menu.UploadSpeed.921600=921600
t-beam.menu.UploadSpeed.921600.upload.speed=921600
t-beam.menu.UploadSpeed.115200=115200
t-beam.menu.UploadSpeed.115200.upload.speed=115200
t-beam.menu.UploadSpeed.256000.windows=256000
t-beam.menu.UploadSpeed.256000.upload.speed=256000
t-beam.menu.UploadSpeed.230400.windows.upload.speed=256000
t-beam.menu.UploadSpeed.230400=230400
t-beam.menu.UploadSpeed.230400.upload.speed=230400
t-beam.menu.UploadSpeed.460800.linux=460800
t-beam.menu.UploadSpeed.460800.macosx=460800
t-beam.menu.UploadSpeed.460800.upload.speed=460800
t-beam.menu.UploadSpeed.512000.windows=512000
t-beam.menu.UploadSpeed.512000.upload.speed=512000

t-beam.menu.DebugLevel.none=None
t-beam.menu.DebugLevel.none.build.code_debug=0
t-beam.menu.DebugLevel.error=Error
t-beam.menu.DebugLevel.error.build.code_debug=1
t-beam.menu.DebugLevel.warn=Warn
t-beam.menu.DebugLevel.warn.build.code_debug=2
t-beam.menu.DebugLevel.info=Info
t-beam.menu.DebugLevel.info.build.code_debug=3
t-beam.menu.DebugLevel.debug=Debug
t-beam.menu.DebugLevel.debug.build.code_debug=4
t-beam.menu.DebugLevel.verbose=Verbose
t-beam.menu.DebugLevel.verbose.build.code_debug=5

